define('Core/TimeInterval', ['Types/entity', 'Env/Env'], function(entity, Env) {
   //MOVE_TO МАЛЦЬЕВ
   /**
    * Реализация объекта "Временной интервал".
    *
    * "Временной интервал" предназначен для хранения относительного временного промежутка, т.е. начало и окончание которого
    * не привязано к конкретным точкам во времени. Он может быть использован для хранения времени выполнения какого-либо
    * действия или для хранения времени до наступления события. При установке значения переменной данного типа, сохраняется
    * только дельта. При этом нужно учитывать, что интервал нормализует значения. В результате, интервал в 1 день, 777 часов,
    * 30 минут будет преобразован в интервал равный 33-м дням, 9 часам, 30 минутам, и будет сохранён именно в таком формате.
    * Формат ISO 8601 урезан до дней. Причина в том, что в случае использования месяцев и лет возникает неоднозначность. В итоге,
    * строковой формат выглядит так:
    * P[<Число_недель>W][<Число_дней>D][T[<Число_часов>H][<Число_минут>M][<Число_секунд>[.Число_долей_секунды]S]
    *
    * @class Core/TimeInterval
    * @deprecated используйте Types/entity:TimeInterval
    * @public
    * @author Бегунов А.В.
    */
  if (typeof window !== 'undefined' && Env.IoC.has('ILogger')) {
      Env.IoC.resolve('ILogger').warn('Core/TimeInterval', 'Модуль устарел и будет удален используйте Types/entity:TimeInterval');
   }

   return entity.TimeInterval;

});
